<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"  %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt" %>
<%@ page import="java.util.*, java.lang.*" %>
<%@ page import="java.text.*, java.net.InetAddress" %>
<c:set var="path1" value="<%=request.getContextPath() %>" />
<!DOCTYPE html>
<html>
<head> 
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta charset="UTF-8">
	<title>약관 동의</title>
	<jsp:include page="/head.jsp" />
	<%@ include file="/header.jsp" %>
</head>
<style>
 .agree_fr { 
 	width: 700px; white-space:pre-wrap; margin: 10px auto; 
 	padding: 24px; border:2px solid #eee; height:600px; overflow-y:auto; margin-top:40px;}
 	
 	.btn_fr , .ck_box {
    text-align: center;
    margin-top: 20px;
}
</style>
<body>

 
   <section class="section">
    <div class="container">
     <h1 class="title">약관 동의</h1>
	  <table class="table">
	   <article class="agree_fr">
            
    제1장 총 칙
    제1조(목적) 이 약관은 군산시청(이하 "군산시"라 합니다)의 홈페이지를 이용함에 있어 이용자와 군산시간의 권리.의무 및 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
    
    
    제2조(정의) 이 약관에서 사용하는 용어의 정의는 다음 각 호와 같습니다. 
    1. 이용자 : 서비스에 접속하여 군산시가 제공하는 서비스를 받는 회원 및 비회원
    2. 회원 : 서비스에 접속하여 이약관에 동의하고, 본인확인 절차를 통해 아이디와 비밀번호를 부여받은자
    3. 비회원 : 회원가입을 하지 않고 군산시가 제공하는 서비스를 이용하는 자
    4. 아이디 : 군산시가 승인하는 문자와 숫자의 조합
    5. 비밀번호 : 비밀 보호를 위해 회원 자신이 설정한 문자, 숫자, 특수문자의 조합 
    
    
    
    제3조(효력의 발생과 변경) 
    ① 이 약관의 내용은 군산시 홈페이지 화면에 게시하거나 기타의 방법으로 공지함으로써 효력이 발생됩니다. 
    ② 군산시는 이 약관을 변경할 수 있으며, 변경된 약관은 이용자에게 공지함으로써 효력이 발생됩니다. 
    
    
    
    
    제2장 서비스 이용계약 
    제4조(이용계약의 성립) 이용계약은 이용자의 약관내용에 대한 동의와 이용자의 이용신청에 대한 군산시의 승낙으로 성립합니다.
    
    
    제5조(이용신청) 이용신청은 군산시 홈페이지의 회원가입 화면에서 이용자가 군산시에서 정한 가입신청서에 기록하여 신청할 수 있습니다.
    
    
    제6조(이용신청의 승낙) 
    ① 군산시는 제5조에서 정한 사항을 정확히 기재하여 이용신청을 하였을 때 제2항, 제3항의 경우를 예외로 하고 승낙할 수 있습니다.
    ② 다음 각 호에 해당하는 경우에는 이용 승낙을 유보할 수 있습니다. 
    1. 설비에 여유가 없거나 기술상 지장이 있는 경우
    2. 기타 군산시의 사정으로 이용승낙이 곤란한 경우
    
    ③ 다음 각 호에 해당하는 경우에는 이용 승낙을 하지 않을 수 있습니다. 
    1. 이름이 실명이 아닌 경우
    2. 이용신청의 내용을 허위로 기재한 경우
    3. 다른 사람의 명의를 사용하여 신청한 경우 
    4. 기타 이용신청 요건에 미비 되었을 때
    
    
    
    제7조(계약사항의 변경 및 해지) 
    ① 회원은 이용신청 시 기재한 사항이 변경되었을 경우에는 그 사항을 온라인으로 수정을 해야 합니다. 
    ② 회원은 서비스 가입을 해지하고자 할 경우에는 온라인으로 해지를 할 수 있습니다.
    
    
    
    제3장 계약당사자의 의무 
    제8조(군산시의 의무) 
    군산시는 서비스 제공과 관련해서 알고 있는 회원의 신상 정보를 본인의 승낙 없이 제3자에게 누설·배포하지 않습니다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 또는 기타 관계법령에서 정한 절차에 의한 요청이 있을 경우에는 그러하지 않습니다 
    
    
    제9조(회원의 의무) 
    ① 회원은 서비스를 이용할 때 다음 각호의 행위를 하지 않아야 합니다. 
    1. 다른 회원의 ID를 부정하게 사용하는 행위 
    2. 서비스에서 얻은 정보를 복제, 출판 또는 제3자에게 제공하는 행위 
    3. 군산시의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위 
    4. 공공질서 및 미풍양속에 위반되는 내용을 유포하는 행위 
    5. 범죄와 결부된다고 객관적으로 판단되는 행위 
    6. 기타 관계법령에 위반되는 행위 
    
    ② 회원은 서비스를 이용하여 영업활동을 할 수 없으며, 영업활동에 이용하여 발생한 결과에 대하여 군산시는 책임을 지지 않습니다. 
    ③ 회원은 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도·증여할 수 없으며, 이를 담보로도 제공할 수 없습니다. 
    
    
    
    
    
    제4장 서비스 이용
    제10조(군산시의 의무) 
    군산시는 서비스 제공과 관련해서 알고 있는 회원의 신상 정보를 본인의 승낙 없이 제3공자에게 누설.배포하지 않습니다. 단, 정기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 또는 기타 관계법령에서 정한 절차에 의한 요청이 있을 경우에는 그러하지 않습니다.
    
    
    제11조(회원 홈페이지에 관한 의무) 
    ① 회원은 필요에 따라 자신의 홈페이지, 게시판, 방명록, 등록자료 유지보수에 대한 관리책임을 갖습니다.
    
    ② 회원은 군산시에서 제공하는 자료를 임의로 삭제, 변경할 수 없습니다.
    
    ③ 회원은 자신의 홈페이지에 공공질서 및 미풍양속에 위반되는 내용물이나 제3자의 저작권 등 기타권리를 침해하는 내용물을 등록하는 행위를 하지 않아야 합니다. 만약 이와 같은 내용물을 게재 하였을때 발생하는 결과에 대한 모든 책임은 회원에게 있습니다.
    
    ④ 회원은 자신의 책임 하에 개설한 홈페이지를 백업 등 여러 가지 방법으로 본인이 관리하여야 합니다. 
    
    
    제12조(회원의 게시물 관리 및 삭제) 
    효율적인 서비스 운영을 위하여 회원의 메모리 공간, 메시지크기, 보관일수 등을 제한할 수 있으며 등록하는 내용이 다음 각 호에 해당하는 경우에는 사전 통지 없이 삭제할 수 있습니다.
    
    1. 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우.
    
    2. 공공질서 및 미풍양속에 위반되는 내용인 경우
    
    3. 범죄적 행위에 결부된다고 인정되는 내용인 경우
    
    4. 군산시의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
    
    5. 회원이 자신의 홈페이지와 게시판에 음란물을 게재하거나 음란 사이트를 링크하는 경우
    
    6. 기타 관계법령에 위반된다고 판단되는 경우
    
    
    제13조(게시물의 저작권) 
    게시물의 저작권은 게시자 본인에게 있으며 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용할 수 없습니다. 
    
    
    제14조(서비스 이용기간) 
    서비스의 이용은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙적으로 합니다. 다만 정기 점검 등의 사유 발생시는 그러하지 않습니다.
    
    
    제15조(서비스 이용 책임) 
    서비스를 이용하여 해킹, 음란사이트 링크, 상용S/W 불법배포 등의 행위를 하여서는 아니 되며 이를 위반으로 인해 발생한 영업활동의 결과 및 손실, 관계기관에 의한 법적 조치 등에 관하여는 군산시는 책임을 지지 않습니다.
    
    
    제16조(서비스 제공의 중지) 
    다음 각 호에 해당하는 경우에는 서비스 제공을 중지할 수 있습니다.
    
    1. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
    
    2. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
    
    3. 시스템 점검이 필요한 경우
    
    4. 기타 불가항력적 사유가 있는 경우
    
    
    
    제5장 계약해지 및 이용제한
    제17조(계약해지 및 이용제한) 
    ① 회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 인터넷을 통하여 해지신청을 하여야 하며, 군산시에서는 본인 여부를 확인 후 조치합니다. 
    ② 군산시는 회원이 다음 각 호에 해당하는 행위를 하였을 경우 사전 통지 없이 이용계약을 해지하거나 또는 서비스 이용을 중지할 수 있습니다. 
    1. 타인의 이용자ID 및 비밀번호를 도용한 경우 
    2. 서비스 운영을 고의로 방해한 경우 
    3. 허위로 가입 신청을 한 경우
    4. 같은 사용자가 다른 ID로 이중 등록을 한 경우 
    5. 공공질서 및 미풍양속에 저해되는 내용을 유포시킨 경우 
    6. 타인의 명예를 손상시키거나 불이익을 주는 행위를 한 경우 
    7. 서비스의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우 
    8. 정보통신설비의 오작동이나 정보 등의 파괴를 유발시키는 컴퓨터바이러스 프로그램 등을 유포하는 경우 
    9. 군산시 또는 다른 회원이나 제3자의 지적재산권을 침해하는 경우
    10. 타인의 개인정보, 이용자ID 및 비밀번호를 부정하게 사용하는 경우 
    11. 회원이 자신의 홈페이지나 게시판 등에 음란물을 게재하거나 음란 사이트를 링크하는 경우
    12. 기타 관련법령에 위반된다고 판단되는 경우 
    
    
    
    
    
    제6장 면 책 
    제18조(면책 조항) 
    ① 군산시는 회원이 서비스를 이용하여 얻은 정보 및 자료 등에 대하여 책임을 지지 않습니다.
    ② 군산시은 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 기타 어떠한 내용에 관하여서도 책임을 지지 않습니다. 
    
    
    제19조(재판 관할) 
    서비스 이용으로 발생한 분쟁에 대해 소송이 제기 될 경우 본청 소재지를 관할하는 법원을 전속관할법원으로 합니다. 
    
    
    
    부 칙
    
    이 약관은 2014년 2월 17일부터 시행합니다.
		  </article>	
	<div class="ck_box">
		<input type="checkbox" id="ck_item1" style="text-align: center";>
		  <label for="text">
		   약관에 동의
		</label>
	</div>
	
	<article class="agree_fr">
	     ① 수집하는 개인정보 항목 
	      1. 필수항목 : 아이디, 이름, 비밀번호, 생년월일, 성별, 군산시민여부, 만 14세 미만 회원 보호자(법적대리인)정보
	      2. 자동수집항목 : IP Address, 서비스 이용기록 등 
	      
	      
	      ② 개인정보의 수집 및 이용목적 
	      1. 아이디, 이름, 비밀번호, 생년월일, 성별, 군산시민여부: 서비스 이용에 따른 민원사항의 처리를 위한 본인식별, 중복가입확인, 부정 이용 방지, 고지사항 전달, 본인의사확인, 불만처리 등 의사소통의 경로의 확보, 이벤트 정보 등 최신 정보안내, 이용통계 분석자료 등을 위하여 사용 
	      2. 이용자의 IP주소, 방문일시 : 불량회원의 부정 이용방지와 비인가 사용방지, 통계학적분석
	      3. 만 14세 미만 아동의 개인정보를 수집할 때는 부모님 등 보호자(법에서 정하고 있는 대리인, 즉 법정대리인)의 동의를 받아야 하기 때문에 보호자 정보도 함께 수집
	      
	      
	      ③ 개인정보의 보유 및 이용기간 
	      1. 보존근거 : 정보주체의 동의
	      2. 보존기간 : 회원 탈퇴 후 1년 
	      
	      
	      ④ 군산시는 홈페이지 회원가입 시 수집된 정보를 본 이용계약상의 서비스 제공을 위한 목적으로만 사용하며, 회원의 승낙 없이 제3자에게 누설 또는 배포할 수 없습니다. 다만, 다음의 각 호의 경우에는 그러하지 아니합니다.
	      1. 관계 법령에 의하여 수사상의 목적으로 관계기관으로부터 요구가 있는 경우
	      2. 정보통신윤리위원회의 요청이 있는 경우
	      3. 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
	      
	      
	      ⑤ 동의 거부 권리 및 불이익 : 동의를 거부할 권리가 있으며, 거부 시 회원가입을 제한합니다. 
	 </article>	
	 <div class="ck_box">
		 <input type="checkbox" id="ck_item2">
		  <label for="text">
		   약관에 동의
		</label>
	</div>
		<div class="btn-group">
		<button type="button" id="in_btn1" class="button is-success is-light">다음 단계로</button>
		</div>
	</table>
	</div>
   </section>
  <script>
	var ck_item1 = document.getElementById("ck_item1");
	var ck_item2 = document.getElementById("ck_item2");
	var in_btn1 = document.getElementById("in_btn1");
	in_btn1.addEventListener("click", function(){
		if(ck_item1.checked && ck_item2.checked){
			location.href = "signUp.jsp";
		} else {
			alert("약관 및 개인정보처리 방침에 동의하지 않으셨습니다.");
			return;
		}
	});
	function protocol(){
		ck_item1.checked = true;
		ck_item2.checked = true;
	}
	</script>
</body>
</html>